#pragma once
#include "gameNode.h"
#include "Loading.h"

//===========================
//	## Class 선언 부분 ##
//===========================


//===========================

//===========================
//	## Define 선언 부분 ##
//===========================


//===========================

//===========================
//	## Struct 선언 부분 ##
//===========================


//===========================

class IntroLoadingScene : public gameNode
{
private:
	Loading* loading;
public:
	IntroLoadingScene();
	~IntroLoadingScene();

	//===========================
	//	## Base 함수 ##
	//===========================
	HRESULT init();
	void release();
	void update();
	void render();
	//===========================

	//===========================
	//	## 초기화 부분 함수 ##
	//===========================
	void XFileSetting();
	void OBJFileSetting();
	void ControllerSetting();
	void UISetting();
	//===========================

	//===========================
	//	## 함수 추가 부분 ##
	//===========================

	//===========================
};

